<?php
/*
 |--------------------------------------------------------------------------
 | エンティティの定義
 |--------------------------------------------------------------------------
 */
$entitySettings = [
      /*
      |--------------------------------------------------------------------------
      | 楽観排他を使用するカラム名
      |--------------------------------------------------------------------------
      | null: 未使用
      */
      'optimistic-lock-column' => null, // 楽観排他を使用する場合、カラム名を指定
      /*
      |--------------------------------------------------------------------------
      | データの作成ユーザー、更新ユーザーのカラムを使用するか
      |--------------------------------------------------------------------------
      | use_created_user_id: true(作成ユーザー列を使用する), false(作成ユーザー列を使用しない)
      | use_updated_user_id: true(更新ユーザー列を使用する), false(更新ユーザー列を使用しない)
      */
      'use_created_user_id'    => true,
      'use_updated_user_id'    => true,
      /*
      |--------------------------------------------------------------------------
      | 論理削除データ管理カラム
      |--------------------------------------------------------------------------
      | flag    : 削除フラグ
      | datetime: 削除日時
      */
      'is_deleted' => 'flag'
];